In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame( {"first":[222,333,444], "data":[123,123,123]} )
df2 = pd.DataFrame( {"second":[333,222,444], "data":[789,789,789]} )

In [3]:
df1

   first  data
0    222   123
1    333   123
2    444   123

In [4]:
df2

   second  data
0     333   789
1     222   789
2     444   789

In [6]:
result = pd.merge( df1, df2, left_on="first", right_on="second" )

In [7]:
result

   first  data_x  second  data_y
0    222     123     222     789
1    333     123     333     789
2    444     123     444     789